In [2]:
import pandas as pd
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [3]:
print(obj1)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [4]:
print(obj2)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [5]:
print(obj3)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [6]:
print(sdata)

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [7]:
print(states)

['California', 'Ohio', 'Oregon', 'Texas']

In [8]:
x = obj2['California']
print(x)

nan

In [9]:
import math
math.isnan(obj2['California'])

True

In [10]:
obj2['California'] != x

True

In [12]:
obj2['California'] == None

False

In [13]:
obj3['California']

True

In [19]:
df = pd.DataFrame([pd.Series({'SerialNo': '1', 'GRE': 337, 'toefl': 118}), 
                   pd.Series({'SerialNo': '2', 'GRE': 324, 'toefl': 107}), 
                   pd.Series({'SerialNo': '3', 'GRE': 316, 'toefl': 104}),
                   pd.Series({'SerialNo': '4', 'GRE': 322, 'toefl': 110}),
                   pd.Series({'SerialNo': '5', 'GRE': 314, 'toefl': 103})],
                  index=['bob', 'fred', 'george','ted','alice'])

In [20]:
df

       SerialNo  GRE  toefl
bob           1  337    118
fred          2  324    107
george        3  316    104
ted           4  322    110
alice         5  314    103

In [21]:
df.where(df['toefl']>105)

       SerialNo    GRE  toefl
bob           1  337.0  118.0
fred          2  324.0  107.0
george      NaN    NaN    NaN
ted           4  322.0  110.0
alice       NaN    NaN    NaN

In [22]:
df.where(df['toefl']>105).dropna()

     SerialNo    GRE  toefl
bob         1  337.0  118.0
fred        2  324.0  107.0
ted         4  322.0  110.0

In [24]:
df[df['toefl']>105]

     SerialNo  GRE  toefl
bob         1  337    118
fred        2  324    107
ted         4  322    110

In [29]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6],[7, 8, 9], [10, 11, 12]])

In [27]:
df

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [30]:
df = pd.DataFrame([{'SerialNo': '1', 'GRE': 337, 'toefl': 118}, 
                   {'SerialNo': '2', 'GRE': 324, 'toefl': 107}, 
                   {'SerialNo': '3', 'GRE': 316, 'toefl': 104},
                   {'SerialNo': '4', 'GRE': 322, 'toefl': 110},
                   {'SerialNo': '5', 'GRE': 314, 'toefl': 103}],
                  index=['bob', 'fred', 'george','ted','alice'])

In [31]:
df

       SerialNo  GRE  toefl
bob           1  337    118
fred          2  324    107
george        3  316    104
ted           4  322    110
alice         5  314    103

In [32]:
states

['California', 'Ohio', 'Oregon', 'Texas']

In [33]:
states = ['Ohio', 'Colorado', 'Utah', 'New York']

In [34]:
states

['Ohio', 'Colorado', 'Utah', 'New York']

In [39]:
statesDF=pd.DataFrame([{'one':0, 'two':1, 'three':2, 'four': 4}, 
                        {'one':4, 'two':5, 'three':6, 'four': 7},
                        {'one':8, 'two':9, 'three':10, 'four':11},
                        {'one':12, 'two':13, 'three':14, 'four': 15}],
                         index=states)

In [40]:
statesDF

          one  two  three  four
Ohio        0    1      2     4
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [41]:
statesDF.drop('Ohio')
statesDF

          one  two  three  four
Ohio        0    1      2     4
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [42]:
statesDF.drop(['Ohio'])
statesDF

          one  two  three  four
Ohio        0    1      2     4
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [43]:
statesDF

          one  two  three  four
Ohio        0    1      2     4
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
a=statesDF.drop('Ohio')
a

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [45]:
a=statesDF.drop(['Utah','Colorado'])
a

          one  two  three  four
Ohio        0    1      2     4
New York   12   13     14    15

In [46]:
a=statesDF.drop('one', axis=1)
a

          two  three  four
Ohio        1      2     4
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [47]:
a=statesDF.drop('two')
a

KeyError: "['two'] not found in axis"

In [48]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [49]:
s1

1    Alice
2     Jack
3    Molly
dtype: object

In [50]:
s2

Alice    1
Jack     2
Molly    3
dtype: int64

In [51]:
s1.loc[1]

'Alice'

In [52]:
s2.iloc[1]

2

In [55]:
s2.loc[1]

KeyError: 1

In [54]:
s2[1]

2

In [56]:
df

       SerialNo  GRE  toefl
bob           1  337    118
fred          2  324    107
george        3  316    104
ted           4  322    110
alice         5  314    103

In [57]:
s.loc['bob']

NameError: name 's' is not defined

In [59]:
df[df['toefl'].gt(105) & df['toefl'].lt(115)]

     SerialNo  GRE  toefl
fred        2  324    107
ted         4  322    110

In [61]:
(df['toefl'] > 105) & (df['toefl'] < 115)

bob       False
fred       True
george    False
ted        True
alice     False
Name: toefl, dtype: bool

In [63]:
df[df['toefl'].gt(105) & df['toefl'].lt(115)]

     SerialNo  GRE  toefl
fred        2  324    107
ted         4  322    110

In [65]:
df[(df['toefl'].isin(range(106, 115)))]

     SerialNo  GRE  toefl
fred        2  324    107
ted         4  322    110

In [68]:
major=df.DataFrame([{'Name':'Alice', 'Age':20, 'Gender':'F'},
        {'Name':'Jack', 'Age':22, 'Gender':'M'}], 
                   index=['Math', 'Soc'])

AttributeError: 'DataFrame' object has no attribute 'DataFrame'

In [70]:
statesDF=pd.DataFrame([{'Name':'Alice', 'Age':20, 'Gender':'F'}, 
                        {'Name':'Jack', 'Age':21, 'Gender':'M'}],
                         index=['Math', 'Soc'])

In [71]:
statesDF

       Name  Age Gender
Math  Alice   20      F
Soc    Jack   21      M

In [73]:
statesDF.T['Math']

Name      Alice
Age          20
Gender        F
Name: Math, dtype: object